modm-ext/data.modm.io/docs/svd/header_stm32u031xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP1</name>
      <description>Comparator</description>
      <baseAddress>0x40010200</baseAddress>
      <interrupt>
        <name>ADC_COMP1</name>
        <description>ADC and COMP1 interrupts (ADC combined with EXTI 17 &amp; 18)</description>
        <value>12</value>
      </interrupt>
      <registers>
        <register>
          <name>CSR</name>
          <description>COMP control and status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>COMPx enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INMSEL</name>
              <description>COMPx input minus selection bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MINUS_1_4VREFINT</name>
                  <description>Comparator input minus connected to 1/4 VrefInt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINUS_1_2VREFINT</name>
                  <description>Comparator input minus connected to 1/2 VrefInt</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINUS_3_4VREFINT</name>
                  <description>Comparator input minus connected to 3/4 VrefInt</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFINT</name>
                  <description>Comparator input minus connected to VrefInt</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC1_CH1</name>
                  <description>Comparator input minus connected to DAC1 channel 1 (DAC_OUT1)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO1</name>
                  <description>Comparator input minus connected to IO1 (pin PC4 for COMP1, pin PB7 for COMP2)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO2</name>
                  <description>Comparator input minus connected to IO2 (pin PB1 for COMP1, pin PB3 for COMP2)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO3</name>
                  <description>Comparator input minus connected to IO3 (pin PA0 for COMP1, pin PA2 for COMP2)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO4</name>
                  <description>Comparator input minus connected to IO4 (pin PA4 for COMP1, pin PA4 for COMP2)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO5</name>
                  <description>Comparator input minus connected to IO5 (pin PA5 for COMP1, pin PA5 for COMP2)</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPSEL</name>
              <description>COMPx input plus selection bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IO1</name>
                  <description>Comparator input plus connected to IO1 (pin PC5 for COMP1, pin PB4 for COMP2)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO2</name>
                  <description>Comparator input plus connected to IO2 (pin PB2 for COMP1, pin PB6 for COMP2)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO3</name>
                  <description>Comparator input plus connected to IO3 (pin PA1 for COMP1, pin PA3 for COMP2)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO4</name>
                  <description>Comparator input plus connected to IO4 (pin PA9 for COMP1, pin PD10 for COMP2)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO5</name>
                  <description>Comparator input plus connected to IO5 (pin PC6 for COMP1)</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WINMODE</name>
              <description>COMPx Windows mode selection bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WINOUT</name>
              <description>COMPx polarity selection bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POLARITY</name>
              <description>COMPx polarity selection bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONINVERTED</name>
                  <description>COMP output polarity is not inverted: comparator output is high when the plus (non-inverting) input is at a higher voltage than the minus (inverting) input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>COMP output polarity is inverted: comparator output is low when the plus (non-inverting) input is at a lower voltage than the minus (inverting) input</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HYST</name>
              <description>COMPx hysteresis selection bits</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No hysteresis</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Hysteresis level low</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEDIUM</name>
                  <description>Hysteresis level medium</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Hysteresis level high</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRMODE</name>
              <description>COMPx Power Mode of the comparator</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGHSPEED</name>
                  <description>COMP power mode to high speed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MEDIUMSPEED</name>
                  <description>COMP power mode to medium speed</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULTRALOWPOWER</name>
                  <description>COMP power mode to ultra-low power</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLANKSEL</name>
              <description>COMPx blanking source selection bits</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Comparator output without blanking</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_OC4</name>
                  <description>Comparator output blanking source TIM1 OC4 (common to all COMP instances: COMP1, COMP2)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_OC5</name>
                  <description>Comparator output blanking source TIM1 OC5 (common to all COMP instances: COMP1, COMP2)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_OC3</name>
                  <description>Comparator output blanking source TIM2 OC3 (common to all COMP instances: COMP1, COMP2)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_OC3</name>
                  <description>Comparator output blanking source TIM3 OC3 (common to all COMP instances: COMP1, COMP2)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM15_OC2</name>
                  <description>Comparator output blanking source TIM15 OC2 (common to all COMP instances: COMP1, COMP2)</description>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALUE</name>
              <description>Comparator output level</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCK</name>
              <description>COMPx Lock Bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
